//XCLUSDEL JOB 1,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
	   DELETE Z80577.CLMDB CLUSTER PURGE