//XCLUSTER JOB 1,NOTIFY=&SYSUID
//STEP1 EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSOUT DD SYSOUT=*
//SYSIN DD *
	   DEFINE CLUSTER(NAME(Z80577.CLMDB) -
      INDEXED -
      KEYS(8 0) -
      RECSZ(310 310) -
      CISZ(4096) -
      VOLUMES(VPWRKA) -
      TRACKS(15) -
      FREESPACE(3 3) -
      NOREUSE)